# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\vmware-host\Shared Folders\scottcarlson On My Mac\Code\repos\MagField_LowFreq_Detector\DelSig_16Channel-20bit-DMA.cydsn\DelSig_16Channel-20bit-DMA.cyprj
# Date: Wed, 04 Nov 2015 00:05:57 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_Ext_CP_Clk} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 23} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_theACLK(fixed-function)} -period 333.33333333333337 -waveform {0 166.666666666667} [get_pins {ClockBlock/aclk_glb_ff_0}]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for \\vmware-host\Shared Folders\scottcarlson On My Mac\Code\repos\MagField_LowFreq_Detector\DelSig_16Channel-20bit-DMA.cydsn\TopDesign\TopDesign.cysch
# Project: \\vmware-host\Shared Folders\scottcarlson On My Mac\Code\repos\MagField_LowFreq_Detector\DelSig_16Channel-20bit-DMA.cydsn\DelSig_16Channel-20bit-DMA.cyprj
# Date: Wed, 04 Nov 2015 00:05:51 GMT
